# 了解AMM
## 为什么需要做市商
交易是金融市场的基本要素，要保证较大量交易时的深度和效率，就需要做市商来提供流动性。做市商提供了一个较大且稳定的流动池，交易者就可以通过流动池进行及时且平滑的交易。
## 什么是 AMM
AMM 是 Automated Market Maker 的缩写，指自动做市商。AMM 是通过算法而非人为进行定价的一种做市手段。AMM 是将算法部署到智能合约上，流动性提供者基于此算法将流动性注入，交易时根据算法和流动性进行定价。相较于传统 MM，AMM 有如下好处：
1. AMM 是基于算法的，不依赖于买卖双方的交互行为。
2. AMM 的流动性提供是去中心化的，流动性提供不依赖专业机构，任何人都能参与。
3. 针对不同的场景，可以设计不同的 AMM 算法针对性解决问题。
## AMM 的产生背景
去中心化交易是 crypto 行业一直在追求的最终交易形态，早在 2016 年，BitShares（比特股）就支持了 Dex 功能，但其存在学习门槛高，深度不足等问题。2017 年，以Etherdelta（以德）为代表的的订单薄机制的 Dex 诞生，虽然几乎没有增加学习成本，但其存在其链上交互频繁、无撮合、交易速度慢等影响，导致其深度教差。
上述两种 Dex 的最大问题，就是其依赖人工交易订单构建交易深度，在性能和体验问题得不到解决的情况下，很难建立满足大规模交易的有效深度，因此通过算法来提升有限流动性池的资金利用率，似乎成了唯一选择，只有这样才能保证深度有限时的交易时效和平滑。尤其在当今加密货币种类繁多的情况下，AMM针对 LTA（长尾资产）更好的流动性解决方案。
# 常见的 AMM 机制
* Bancor - Bancor Network
* 恒定乘积 - Uniswap
* 恒定和 - Balancer
* Curve - Curve
